


// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом.
//     Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li.
//     Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li.
//     Текст li задати через аргумент всім однаковий.
//     Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві),
//     та будує для них список

// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх '
// + 'в документ. Для кожного об'єкту окремий блок.
//     // - створити функцію яка обчислює та повертає площу прямокутника


// - створити функцію яка обчислює та повертає площу прямокутника
// зі сторонами а і б
function arraySide(a,b) {
    let areaRectangle = a*b;
    return areaRectangle;
}
console.log(arraySide(10,10))
document.write('<h1>  </h1>' + 'площа прямокутника ='+ arraySide(10,10) + ' '+ '<div></div>')



// - створити функцію яка обчислює та повертає площу кола
// з радіусом r

function arreaRound(r) {
    let rad = r**2;
    let squareRound = 3.14*rad;
    return squareRound;
}
console.log(arreaRound(10))
document.write('<h2>  </h2>' + 'площа кола = ' + arreaRound(10))



// - створити функцію яка обчислює та повертає площу циліндру висотою h,
//     та радіутом r



